SMEAC/microROS_STM32_Robot_HIL/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define USER_Btn_Pin GPIO_PIN_13
#define USER_Btn_GPIO_Port GPIOC
#define MCO_Pin GPIO_PIN_0
#define MCO_GPIO_Port GPIOH
#define Axis_1_Enc_A_Pin GPIO_PIN_0
#define Axis_1_Enc_A_GPIO_Port GPIOA
#define Axis_1_Enc_B_Pin GPIO_PIN_1
#define Axis_1_Enc_B_GPIO_Port GPIOA
#define Axis_2_Enc_A_Pin GPIO_PIN_6
#define Axis_2_Enc_A_GPIO_Port GPIOA
#define Axis_2_Enc_B_Pin GPIO_PIN_7
#define Axis_2_Enc_B_GPIO_Port GPIOA
#define Axis_1_dir_Pin GPIO_PIN_0
#define Axis_1_dir_GPIO_Port GPIOG
#define Axis_2_dir_Pin GPIO_PIN_1
#define Axis_2_dir_GPIO_Port GPIOG
#define STLK_RX_Pin GPIO_PIN_8
#define STLK_RX_GPIO_Port GPIOD
#define STLK_TX_Pin GPIO_PIN_9
#define STLK_TX_GPIO_Port GPIOD
#define End_axis_5_d_Pin GPIO_PIN_10
#define End_axis_5_d_GPIO_Port GPIOD
#define End_axis_5_u_Pin GPIO_PIN_11
#define End_axis_5_u_GPIO_Port GPIOD
#define End_axis_6_d_Pin GPIO_PIN_14
#define End_axis_6_d_GPIO_Port GPIOD
#define End_axis_6_u_Pin GPIO_PIN_15
#define End_axis_6_u_GPIO_Port GPIOD
#define Axis_3_dir_Pin GPIO_PIN_2
#define Axis_3_dir_GPIO_Port GPIOG
#define Axis_4_dir_Pin GPIO_PIN_3
#define Axis_4_dir_GPIO_Port GPIOG
#define Axis_5_dir_Pin GPIO_PIN_4
#define Axis_5_dir_GPIO_Port GPIOG
#define Axis_6_dir_Pin GPIO_PIN_5
#define Axis_6_dir_GPIO_Port GPIOG
#define USB_PowerSwitchOn_Pin GPIO_PIN_6
#define USB_PowerSwitchOn_GPIO_Port GPIOG
#define USB_OverCurrent_Pin GPIO_PIN_7
#define USB_OverCurrent_GPIO_Port GPIOG
#define USB_SOF_Pin GPIO_PIN_8
#define USB_SOF_GPIO_Port GPIOA
#define USB_VBUS_Pin GPIO_PIN_9
#define USB_VBUS_GPIO_Port GPIOA
#define USB_ID_Pin GPIO_PIN_10
#define USB_ID_GPIO_Port GPIOA
#define USB_DM_Pin GPIO_PIN_11
#define USB_DM_GPIO_Port GPIOA
#define USB_DP_Pin GPIO_PIN_12
#define USB_DP_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define End_axis_1_d_Pin GPIO_PIN_0
#define End_axis_1_d_GPIO_Port GPIOD
#define End_axis_1_u_Pin GPIO_PIN_1
#define End_axis_1_u_GPIO_Port GPIOD
#define End_axis_2_d_Pin GPIO_PIN_2
#define End_axis_2_d_GPIO_Port GPIOD
#define End_axis_2_u_Pin GPIO_PIN_3
#define End_axis_2_u_GPIO_Port GPIOD
#define End_axis_3_d_Pin GPIO_PIN_4
#define End_axis_3_d_GPIO_Port GPIOD
#define End_axis_3_u_Pin GPIO_PIN_5
#define End_axis_3_u_GPIO_Port GPIOD
#define End_axis_4_d_Pin GPIO_PIN_6
#define End_axis_4_d_GPIO_Port GPIOD
#define End_axis_4_u_Pin GPIO_PIN_7
#define End_axis_4_u_GPIO_Port GPIOD
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define LD2_Pin GPIO_PIN_7
#define LD2_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
